# NewSlabEdge Method (SlabEdgeType, Reference)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..NewSlabEdge Method (SlabEdgeType, Reference)
Document Class See Also
---
Creates a slab edge along a reference.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SlabEdge NewSlabEdge(
	SlabEdgeType SlabEdgeType,
	Reference reference
)
```

Visual Basic
---
```text
Public Function NewSlabEdge ( _
	SlabEdgeType As SlabEdgeType, _
	reference As Reference _
) As SlabEdge
```

Visual C++
---
```text
public:
SlabEdge^ NewSlabEdge(
	SlabEdgeType^ SlabEdgeType,
	Reference^ reference
)
```

# ### Parameters
SlabEdgeType
    Type: Autodesk.Revit.DB..::..SlabEdgeType The type of the slab edge to create
reference
    Type: Autodesk.Revit.DB..::..Reference A planar line or arc that represents the place where you want to place the slab edge.
# ### Return Value
If successful a new slab edge object within the project, otherwise nullNothingnullptra null reference (Nothing in Visual Basic).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if the slab edge type does not exist in the given document. |

# See Also
Document Class
NewSlabEdge Overload
Autodesk.Revit.Creation Namespace